[
  {
    "id": 1,
    "name": "Cotton T-shirt",
    "img": "https://i.ibb.co/1mhHxNt/pexels-dima-valkov-6211621-1.jpg",
    "description": "Comfortable cotton t-shirt for everyday wear. This cotton t-shirt by Adidas is more than just a basic wardrobe staple—it's a testament to comfort and style. Crafted meticulously from premium quality cotton, this t-shirt offers a luxurious softness that feels gentle against the skin. Its lightweight and breathable nature make it an ideal choice for those seeking comfort during daily activities. The classic design ensures versatility, allowing it to effortlessly complement various outfits, whether you're pairing it with denim jeans for a casual look or layering it under a jacket for added style during cooler days. With its impeccable blend of comfort, quality, and Adidas's renowned brand reliability, this t-shirt becomes an essential go-to option for anyone looking for both functionality and fashion in their clothing choices.",
    "price": 19.99,
    "rating": 4.5,
    "brand": "Adidas"
  },
  {
    "id": 2,
    "name": "Denim Jeans",
    "img": "https://i.ibb.co/MnNFQXJ/pexels-dima-valkov-6211616-1-2.jpg",
    "description": "Classic denim jeans with a modern fit. These denim jeans from Zara redefine timeless fashion with a modern twist. Crafted from high-quality denim fabric, these jeans not only offer durability but also provide a comfortable and flattering fit. The modern design accentuates your silhouette while ensuring freedom of movement, making them suitable for various occasions. Whether you're aiming for a casual, laid-back look or trying to elevate your style with a more refined approach, these jeans offer the versatility to adapt to your fashion preferences. The attention to detail in craftsmanship and the premium material used in these jeans make them an indispensable addition to your wardrobe, providing a perfect balance between classic style and contemporary trends.",
    "price": 39.99,
    "rating": 4.2,
    "brand": "Zara"
  },
  {
    "id": 3,
    "name": "Leather Jacket",
    "img": "https://i.ibb.co/P5ZGhXq/pexels-dima-valkov-6503007-3.jpg",
    "description": "Stylish leather jacket for a trendy look. Elevate your style quotient with this statement piece from Nike—a luxurious leather jacket that embodies sophistication and trendiness. Meticulously crafted from premium-quality leather, this jacket exudes timeless elegance while offering functionality and durability. Its stylish design and attention to detail make it a versatile wardrobe essential, seamlessly complementing both casual and semi-formal attire. The supple texture of the leather ensures a comfortable fit while providing warmth during cooler seasons. Whether you're heading out for a night on the town or looking to add a touch of refinement to your daily ensemble, this leather jacket becomes a defining element in your fashion arsenal, showcasing your discerning taste and flair for fashion.",
    "price": 79.99,
    "rating": 4.8,
    "brand": "Nike"
  },
  {
    "id": 4,
    "name": "Sneakers",
    "img": "https://i.ibb.co/QDV1PHb/pexels-dima-valkov-6511777-1.png",
    "description": "Casual sneakers for a sporty yet fashionable vibe. These sneakers by Nike strike the perfect balance between athletic functionality and urban fashion. Designed to offer both style and comfort, these casual sneakers are crafted with precision and quality materials, ensuring durability and support. The versatile design makes them suitable for various activities, whether you're strolling through the city streets or engaging in light physical activities. The blend of sporty aesthetics and contemporary style elements makes these sneakers a must-have for individuals seeking a casual yet trendy footwear option. Step up your fashion game with these sneakers that effortlessly combine comfort and style, adding a sporty edge to your everyday look.",
    "price": 49.99,
    "rating": 4.0,
    "brand": "Nike"
  },
  {
    "id": 5,
    "name": "Summer Dress",
    "img": "https://i.ibb.co/LgrCDK5/pexels-dima-valkov-6211614-1.png",
    "description": "Flowy summer dress perfect for warm days. Embrace the sunny days with this delightful summer dress from Zara. Crafted with a breezy and lightweight fabric, this dress offers both comfort and style during the warmer seasons. The flowy silhouette and vibrant design make it an ideal choice for various casual occasions, whether it's a beach day, a brunch with friends, or a leisurely stroll. Its effortless charm and versatility allow you to accessorize it according to your preferences, whether you prefer a bohemian flair or a minimalist approach. Elevate your summer wardrobe with this dress that embodies comfort, grace, and a carefree spirit, ensuring you stay fashionable and cool in the sun.",
    "price": 29.99,
    "rating": 4.7,
    "brand": "Zara"
  },
  {
    "id": 6,
    "name": "Formal Suit",
    "img": "https://i.ibb.co/sFLz7ZL/pexels-dima-valkov-6211601-1.png",
    "description": "Elegant formal suit for special occasions. Make a lasting impression with this impeccably tailored formal suit from Adidas. Perfectly suited for special events and formal occasions, this suit exudes sophistication and refinement. The exquisite craftsmanship, premium fabric, and attention to detail in design make it a standout choice for individuals seeking elegance and style. Whether it's a business gathering or a special celebration, this suit ensures a distinguished and polished look. Elevate your sartorial choices with this formal suit that epitomizes class, making you the embodiment of grace and style in any formal setting.",
    "price": 129.99,
    "rating": 4.9,
    "brand": "Adidas"
  }
]